UIACODE = int(input("Enter Key"))
key = {0: 'a', 1: 'b', 2: 'c', 3: 'd', 4: 'e', 5: 'f', 6: 'g', 7: 'h', 8: 'i', 9: 'j', 10: 'k', 11: 'l', 12: 'm', 13: 'n', 14: 'o', 15: 'p', 16: 'q', 17: 'r', 18: 's', 19: 't', 20: 'u', 21: 'v', 22: 'w', 23: 'x', 24: 'y', 25: 'z'}
# คำนวณรหัสที่ได้จากการเลื่อนตัวอักษรในคำว่า "Hello" ตามค่า UIACODE
# อักษร H = 7, E = 4, L = 11, L = 11, O = 14
# แล้วใช้สูตร (ตำแหน่งเดิม + UIACODE) % 26 เพื่อให้วนกลับเมื่อเกิน 'z'
Code = (( 7 + UIACODE )%26,( 4 + UIACODE )%26,( 11 + UIACODE )%26,( 11 + UIACODE )%26,( 14 + UIACODE )%26)
print("ciper of Hello is",key[Code[0]],key[Code[1]],key[Code[2]],key[Code[3]],key[Code[4]],sep = '')
# ใช้ sep='' เพื่อไม่ให้มีช่องว่างระหว่างตัวอักษร
#น้ำลายผมยืดหมดแล้วครับจาร ;-;