# ในแต่ละปีผู้มีเงินรายได้ทุกคนมีหน้าที่ต้องเสียภาษีเงินได้บุคคลธรรมดา (tax) 
# โดยค่าภาษีที่ต้องจ่ายคำนวณจากรายได้สุทธิ (เงินได้หลังจาก หักค่าใช้จ่ายและค่าลดหย่อนภาษี) 
# โดยคิดอัตราภาษีแบบขั้นบันได มีวิธีการคำนวณ ดังนี้
# 1. เงินได้สุทธิ 0 – 150,000 บาท (อัตราภาษี 0% หรือได้รับการยกเว้นภาษี)
#     ภาษี = 0
# 2. เงินได้สุทธิ 150,001 – 300,000 บาท (อัตราภาษี 5%)
#     ภาษี = (เงินได้สุทธิ – 150,000) x 5%
# 3. เงินได้สุทธิ 300,001 – 500,000 บาท (อัตราภาษี 10%)
#    ภาษี = [ (เงินได้สุทธิ – 300,000) x 10% ] + 7,500
# 4. เงินได้สุทธิ 500,001 – 750,000 บาท (อัตราภาษี 15%)
#    ภาษี = [ (เงินได้สุทธิ – 500,000) x 15% ] + 27,500
# 5. เงินได้สุทธิ 750,001 – 1 ล้านบาท (อัตราภาษี 20%)
#    ภาษี = [ (เงินได้สุทธิ – 750,000) x 20% ] + 65,000
# 6. เงินได้สุทธิ 1,000,001 – 2,000,000 บาท (อัตราภาษี 25%)
#    ภาษี = [ (เงินได้สุทธิ – 1,000,000) x 25% ] + 115,000
# 7. เงินได้สุทธิ 2,000,001 – 5,000,000 บาท (อัตราภาษี 30%)
#    ภาษี = [ (เงินได้สุทธิ – 2,000,000) x 30% ] + 365,000
# 8. เงินได้สุทธิมากกว่า 5 ล้านบาท (อัตราภาษี 35%)
#    ภาษี = [ (เงินได้สุทธิ – 5,000,000) x 35% ] + 1,265,000
# โดยโปรแกรมจะรับเงินได้สุทธิต่อปี (net_income) และทำการคำนวณค่าภาษีที่ต้องจ่ายในปีนั้น แสดงผลลัพธ์ออกทางจอภาพ
w = float(input("Please enter your net income: "))
a = 0
if w<150000:
    print("The tax amount you have to pay this year : 0.00")
elif w<=300000:
    a = (w-150000)*0.05
    print(f"The tax amount you have to pay this year : {a:.2f}")
elif w<=500000:
    a = ((w-300000)*0.1)+7500
    print(f"The tax amount you have to pay this year : {a:.2f}")
elif w<=750000:
    a = ((w-500000)*0.15)+27500
    print(f"The tax amount you have to pay this year : {a:.2f}")
elif w<=1000000:
    a = ((w-750000)*0.2)+65000
    print(f"The tax amount you have to pay this year : {a:.2f}")
elif w<=2000000:
    a = ((w-1000000)*0.25)+115000
    print(f"The tax amount you have to pay this year : {a:.2f}")
elif w<=5000000:
    a = ((w-2000000)*0.3)+365000
    print(f"The tax amount you have to pay this year : {a:.2f}")
else:
    a = ((w-5000000)*0.35)+1265000
    print(f"The tax amount you have to pay this year : {a:.2f}")