# นายเอ เปิดร้านขายลูกชิ้นปิ้งอยู่หน้าคณะ แต่นายเอลีลาและขี้เกียจ 
# ต้องมีออเดอร์เข้ามาก่อน เขาถึงจะหยิบลูกชิ้นในถุงมาเสียบไม้ปิ้ง แต่เขาทำเท่าที่ลูกค้าสั่ง ไม่ยอมทำเผื่อไว้ ถ้าสั่ง2ไม้ ก็เสียบลูกชิ้นแค่2ไม้ 

# อยากรู้ว่า หากลูกค้าสั่งลูกชิ้น m ไม้ ซึ่งใน 1 ไม้มีลูกชิ้น k ลูก ถ้าลูกชิ้น 1 ถุงมี n ลูก นายเอต้องหยิบถุงลูกชิ้นมากี่ถุง ถึงจะพอขายให้ลูกค้าคนนั้น

# ตัวอย่างกรณีทดสอบ
# บรรทัดแรกรับจำนวนไม้ที่ลูกค้าสั่ง 
# บรรทัดสองรับจำนวนลูกชิ้นที่จะเสียบ ต่อ 1 ไม้
# บรรทัดสามรับจำนวนลูกชิ้นที่มีใน 1 ถุง
# ผลลัพธ์เป็นจำนวนเต็ม

m = int(input())
k = int(input())
n = int(input())
total = (m*k)
sum = (total + n - 1)//n
print(sum)